//#include<stdio.h>   
// std = standard
// io = input + output 입출력
// .h = 헤더파일(정보를 가지고 있는 c언어만의 파일)
//
//int main(void)
//{
//	// 변수 : 데이터(문자,숫자,논리값...)를 저장하는 공간
//	// ★★단 변수를 만들때는 자료형을 신경써야한다.★★
//
//	 기본(표준) 자료형
//	/*
//	[문자열]
//	* char : character라는 한 글자 저장하는 자료형(1바이트)
//	
//	[정수] 
//	* short : 2바이트 용량을 가지는 자료형으로 약 -32,000 ~ 32,000 정도 저장가능
//	* int : 4바이트 용량을 가지는 자료형으로 약 -21억 ~ 21억 정도 저장가능
//	* long : 4바이트 용량을 가지는 자료형
//	
//	[실수] 
//	* float : 4바이트 용량을 가지는 자료형으로 소수자리수를 표현가능
//	* double : 8바이트 용량을 가지는 자료형으로 엄청나게 정밀한 숫자를 소수자리를 표현할때 사용한다.
//	*/
	
	/*
	예 : 숫자를 5를 기억하는 변수를 만들고 싶다.
	short a = 5;
	int a = 5;
	long a = 5;

	short a = 100000; //불가

	통상적으로 정수를 쓴다면 int를 많이 사용한다.
	
	*/
//
//	int number1, number2;
//	number1 = 1;
//	number2 = 2;
//
//	int number3 = 3, number4 = 4;
//	
	/*사용 불가능한 변수
	1. 변수 이름에는 공백사용 불가
	2. 특수문자 불가(단,_는 가능)
	3. 숫자로 시작 불가
	4. 변수명으로 예약어는 사용 불가(for,if,const등은 이미 c언어에서 사용하는 명령어)
	
	33페이지 예시참고
	*/
//
//
//
//	return 0;
//}